export class Constant {
  public PER_PAGINATION = 6;
  // BC
  public FORM_ID_BC = {
    bc01: 'J00',
    bc01a: 'J30',
    bc01s: 'J01',
    bc02: 'J03',
    bc03: '',
    bc04: 'J04',
    bc05: 'J05',
    bc06: '',
    bc07: '',
    bc08: 'J08',
    bc09: '',
    bc10: 'J10',
    bc11: 'J11',
    bc12: 'J12',
    bc13: 'J13',
    bc14: 'J14',
    bc15: '',
    bc16: '',
    bc17: '',
    bc18: '',
    bc19: '',
    bc20: 'J20',
    bc21: 'J21',
    bc22: 'J22',
    bc41: 'J41',
    bc42: 'J42',
    bc43: 'J43',
    bc44: 'J44',
    bc45: 'J45',
    bc46: 'J46',
    bc47: 'J47',
    bc48: 'J48',
    bc49: 'J49',
    bc50: 'J50',
    bc51: 'J51',
    bc52: 'J52',
    bc53: 'J53',
    bc54: 'J54',
    bc55: 'J55',
  };
  public LIST_TYPE_DOCUMENT_BC011 = [
    { id: 'JM', name: 'JM - บันทึกปรับปรุงบัญชีวัสดุคงคลัง' },
    { id: 'JR', name: 'JR - บันทึกรายการบัญชีเงินสดและเทียบเท่าเงินสด' },
    {
      id: 'JV',
      name: 'JV - บันทึกรายการบัญชีทั่วไปไม่เกี่ยวกับเงินสดและเทียบเท่าเงินสด',
    },
    { id: 'N3', name: 'N3 - บันทึกเบิกหักผลักส่งเงินฝากคลังเป็นรายได้แผ่นดิน' },
    { id: 'PP', name: 'PP - บันทึกจ่ายเงินฝากธนาคารพาณิชย์' },
    { id: 'RE', name: 'RE - บันทึกรับเงินฝากธนาคาร' },
  ];
  public SEARCH_LIST_TYPE_DOCUMENT_BC011 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'JM', name: 'JM - บันทึกปรับปรุงบัญชีวัสดุคงคลัง' },
    { id: 'JR', name: 'JR - บันทึกรายการบัญชีเงินสดและเทียบเท่าเงินสด' },
    {
      id: 'JV',
      name: 'JV - บันทึกรายการบัญชีทั่วไปไม่เกี่ยวกับเงินสดและเทียบเท่าเงินสด',
    },
    { id: 'N3', name: 'N3 - บันทึกเบิกหักผลักส่งเงินฝากคลังเป็นรายได้แผ่นดิน' },
    { id: 'PP', name: 'PP - บันทึกจ่ายเงินฝากธนาคารพาณิชย์' },
    { id: 'RE', name: 'RE - บันทึกรับเงินฝากธนาคาร' },
  ];
  public LIST_TYPE_DOCUMENT_BC013 = [{ id: 'JF', name: 'JF - รับย้ายจ่ายย้าย' }];
  public SEARCH_LIST_TYPE_DOCUMENT_BC01A1 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'BD', name: 'BD - เบิกเกินส่งคืน' },
    { id: 'BE', name: 'BE - คืนงบในปี' },
    { id: 'BF', name: 'BF - คืนงบข้ามปี' },
    { id: 'BT', name: 'BT - เบิกเกินส่งคืน TKK' },
    { id: 'G1', name: 'G1 - ล้างลน. เงินยืมvs.คชจ' },
    { id: 'G4', name: 'G4 - ล้างบัญชีเงินทดรองราชการ/ค่าใช้จ่ายจ่ายล่วงหน้า' },
    {
      id: 'JV',
      name: 'JV - บันทึกรายการบัญชีทั่วไปไม่เกี่ยวกับเงินสดและเทียบเท่าเงินสด',
    },
  ];
  public LIST_TYPE_DOCUMENT_BC01A1 = [
    { id: 'BD', name: 'BD - เบิกเกินส่งคืน' },
    { id: 'BE', name: 'BE - คืนงบในปี' },
    { id: 'BF', name: 'BF - คืนงบข้ามปี' },
    { id: 'BT', name: 'BT - เบิกเกินส่งคืน TKK' },
    { id: 'G1', name: 'G1 - ล้างลน. เงินยืมvs.คชจ' },
    { id: 'G4', name: 'G4 - ล้างบัญชีเงินทดรองราชการ/ค่าใช้จ่ายจ่ายล่วงหน้า' },
    {
      id: 'JV',
      name: 'JV - บันทึกรายการบัญชีทั่วไปไม่เกี่ยวกับเงินสดและเทียบเท่าเงินสด',
    },
  ];
  public LIST_TYPE_DOCUMENT_BC011s = [
    { id: 'JR', name: 'JR - บันทึกรายการบัญชีเงินสดและเทียบเท่าเงินสด' },
    {
      id: 'JV',
      name: 'JV - บันทึกรายการบัญชีทั่วไปไม่เกี่ยวกับเงินสดและเทียบเท่าเงินสด',
    },
  ];
  public SEARCH_LIST_TYPE_DOCUMENT_BC011s = [
    { id: '', name: '---- ไม่กำหนด ----' },

    { id: 'JR', name: 'JR - บันทึกรายการบัญชีเงินสดและเทียบเท่าเงินสด' },
    {
      id: 'JV',
      name: 'JV - บันทึกรายการบัญชีทั่วไปไม่เกี่ยวกับเงินสดและเทียบเท่าเงินสด',
    },
  ];
  public LIST_TYPE_DOCUMENT_BC021 = [{ id: 'SW', name: 'SW - บันทึกปรับปรุงรายการบัญชีค้างรับ/ค้างจ่าย' }];
  public LIST_TYPE_DOCUMENT_BC022 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'JP', name: 'JP - บันทึกปรับปรุงบัญชีบัตรภาษี' },
  ];
  public LIST_TYPE_DOCUMENT_BC20 = [{ id: 'JN', name: 'JN - ปรับปรุงเช็คขัดข้อง' }];
  public LIST_TYPE_DOCUMENT_BC21 = [{ id: 'RR', name: 'RR - รับแทนเช็คขัดข้อง' }];
  public TYPE_ACCOUNT_BC22 = [
    { id: '1101010103', account: '1101010103', name: 'บัตรภาษี' },
    { id: '4308010107', account: '4308010107', name: 'TR โอนบัตรภาษี' },
    { id: '5210010107', account: '5210010107', name: 'TE โอนบัตรภาษีแผ่นดิน' },
  ];
  public LIST_TYPE_DOCUMENT_BC421 = [
    { id: 'JF', name: 'JF - รับย้ายจ่ายย้าย' },
    { id: 'JU', name: 'JU - การโอนเงินของ CGD' },
  ];
  public SAVE_TYPE_ACCOUNT_BC421 = [
    { id: 'JF', name: 'บันทึกการโอนเงินให้ลูกค้ารายใหญ่เข้าบัญชีของลูกค้ารายใหญ่' },
    { id: 'JU', name: 'บันทึกการโอนเงินให้ลูกค้ารายใหญ่เข้าบัญชีกรุงไทยของกรมธนารักษ์ ณ ศูนย์บริหารจัดการเหรียญกษาปณ์' },
  ];
  public SEARCH_LIST_TYPE_DOCUMENT_BC422 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'JF', name: 'JF - รับย้ายจ่ายย้าย' },
    { id: 'JU', name: 'JU - การโอนเงินของ CGD' },
  ];
  public LIST_TYPE_DOCUMENT_BC431 = [{ id: 'JK', name: 'JK - ปรับเงินฝากคลังนอกงบประมาณ' }];
  public SAVE_TYPE_ACCOUNT_BC431 = [
    { id: '0', name: 'บันทึกปรับเพิ่มเงินฝากคลัง' },
    { id: '1', name: 'บันทึกปรับลดเงินฝากคลัง' },
  ];
  public LIST_TYPE_DOCUMENT_BC441 = [{ id: 'J7', name: 'J7 - ผลักส่งไม่รับตัวเงิน' }];
  public LIST_TYPE_DOCUMENT_BC451 = [{ id: 'J7', name: 'J7 - ผลักส่งไม่รับตัวเงิน' }];
  public LIST_TYPE_DOCUMENT_BC461 = [{ id: 'J9', name: 'J9 - ปรับบัญชีจากปีเก่า' }];
  public LIST_TYPE_DOCUMENT_BC471 = [{ id: 'J9', name: 'J9 - ปรับบัญชีจากปีเก่า' }];
  public LIST_TYPE_DOCUMENT_BC481 = [
    { id: 'J8', name: 'J8 - ปรับปรุงผลสะสมจากการแก้ไขข้อผิดพลาด' },
    { id: 'AJ', name: 'AJ - ปรับปรุงเกี่ยวกับค่าเสื่อมราคา' },
    { id: 'KP', name: 'KP - ปรับปรุงบัญชี GR/IR' },
  ];
  public LIST_TYPE_DOCUMENT_BC491 = [{ id: 'JP', name: 'JP – ปรับปรุงบัตรภาษี' }];
  public LIST_TYPE_DOCUMENT_BC501 = [{ id: 'N4', name: 'N4 - ผลักส่งเงินงบประมาณ' }];
  public LIST_TYPE_DOCUMENT_BC511 = [{ id: 'N5', name: 'N5 – ผลักส่งเงินงบประมาณ(ปีใหม่)' }];
  public LIST_TYPE_DOCUMENT_BC521 = [{ id: 'M5', name: 'M5 – ผลักส่งเงินงบประมาณ(ปีเก่า)' }];
  public LIST_TYPE_DOCUMENT_BC531 = [{ id: 'N6', name: 'N6 - ผลักส่งรายได้แผ่นดิน' }];
  public LIST_TYPE_DOCUMENT_BC541 = [{ id: 'N7', name: 'N7 – ผลักส่งรายได้แผ่นดิน' }];
  public LIST_TYPE_DOCUMENT_BC551 = [{ id: 'N8', name: 'N8 – ถอนรายได้แผ่นดินผลักคืนเงินงบประมาณ' }];
  // NS
  public FORM_ID_NS = {
    ns01: 'R01',
    ns021: 'R04',
    ns022: 'R05',
    ns03: 'R00',
    ns041: 'R06',
    ns042: 'R07',
    ns051: 'R44',
    ns052: 'R45',
    ns021a: 'R34',
    ns022a: 'R35',
  };
  // ประเภทการรับเงิน นส01
  public RECEIVING_TYPE_FUND_NS01 = [
    { id: 'RA', name: 'RA - รายได้แผ่นดิน' },
    { id: 'RB', name: 'RB - เงินฝากคลัง' },
  ];
  public LIST_TYPE_RECEIVE_MONEY_NS01 = [
    { id: 'RA', name: 'RA - รายได้แผ่นดิน' },
    { id: 'RB', name: 'RB - เงินฝากคลัง' },
  ];
  public LIST_TYPE_DOCUMENT_NS = new Map([
    ['RA', 'RA - รับรายได้ของตน'],
    ['RB', 'RB - รับรายได้นอกงบตนเอง'],
    ['RC', 'RC - รับรายได้แทนกัน'],
    ['RD', 'RD - รับรายได้นอกแทนกัน'],
    ['R1', 'R1 - นำส่งเงินในของตน'],
    ['R2', 'R2 - นำส่งเงินนอกงบของตน'],
    ['R3', 'R3 - นำส่งเงินในแทนกัน'],
    ['R4', 'R4 - นำส่งเงินนอกแทนกัน'],
    ['SA', 'SA - กลับรับรายได้ตนเอง'],
    ['SB', 'SB - กลับรับรายได้นอกงบตน'],
    ['SC', 'SC - กลับรับรายได้แทนกัน'],
    ['SD', 'SD - กลับรับรายได้นอกแทน'],
    ['S1', 'S1 - กลับนำส่งเงินในตนเอง'],
    ['S2', 'S2 - กลับนำส่งเงินนอกตนเอ'],
    ['S3', 'S3 - กลับนำส่งเงินในแทน'],
    ['S4', 'S4 - กลับนำส่งเงินนอกแทน'],
    ['RX', 'RX - ฝากเงินนอกงบตนเอง'],
    ['RY', 'RY - ฝากเงินนอกงบผู้อื่น'],
    ['OX', 'RY - ฝากเงินนอกงบปีเก่า'],
  ]);

  public LIST_TYPE_SEARCH_RECEIVE_MONEY_NS01 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'RA', name: 'RA - รายได้แผ่นดิน' },
    { id: 'RB', name: 'RB - เงินฝากคลัง' },
  ];
  public LIST_TYPE_MONEY_NS01 = [
    { id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' },
    { id: '1101020601', name: 'กรณีเงินฝากธนาคารเพื่อนำส่งคลัง' },
    { id: '1101020606', name: ' กรณีเงินฝากธนาคารรายบัญชีเพื่อนำส่งคลัง' },
  ];
  public LIST_TYPE_MONEY_NS021 = [
    { id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' },
    { id: '1101020606', name: 'กรณีเงินฝากธนาคารเพื่อนำส่งคลัง' },
    { id: '1101020601', name: 'กรณีเงินฝากธนาคารรายบัญชีเพื่อนำส่งคลัง' },
  ];
  public LIST_TYPE_DEPOSIT_MONEY_NS021 = [
    { id: 'R1', name: 'R1 - รายได้แผ่นดินของตนเอง' },
    { id: 'R2', name: 'R2 - เงินฝากคลังของตนเอง' },
  ];
  public LIST_TYPE_SEARCH_DEPOSIT_MONEY_NS021 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'R1', name: 'R1 - รายได้แผ่นดินของตนเอง' },
    { id: 'R2', name: 'R2 - เงินฝากคลังของตนเอง' },
  ];
  public LIST_TYPE_MONEY_NS022 = [
    { id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' },
    { id: '1101020601', name: 'กรณีเงินฝากธนาคารเพื่อนำส่งคลัง' },
    { id: '1101020606', name: 'กรณีเงินฝากธนาคารรายบัญชีเพื่อนำส่งคลัง' },
  ];
  public LIST_TYPE_DEPOSIT_MONEY_NS022 = [
    { id: 'R3', name: 'R3 - รายได้แผ่นดินแทนกัน' },
    { id: 'R4', name: 'R4 - เงินฝากคลังแทนกัน' },
  ];
  public LIST_TYPE_SEARCH_DEPOSIT_MONEY_NS022 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'R3', name: 'R3 - รายได้แผ่นดินแทนกัน' },
    { id: 'R4', name: 'R4 - เงินฝากคลังแทนกัน' },
  ];

  public LIST_TYPE_MONEY_NS021a = [{ id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' }];
  public LIST_TYPE_DEPOSIT_MONEY_NS021a = [
    { id: 'R6', name: 'R6 - ส่งเงินเบิกเกินในงบ' },
    { id: 'R7', name: 'R7 - ส่งเงินเบิกเกินนอกงบ' },
  ];
  public LIST_TYPE_SEARCH_DEPOSIT_MONEY_NS021a = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'R6', name: 'R6 - ส่งเงินเบิกเกินในงบ' },
    { id: 'R7', name: 'R7 - ส่งเงินเบิกเกินนอกงบ' },
  ];
  public LIST_TYPE_MONEY_NS022a = [{ id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' }];
  public LIST_TYPE_DEPOSIT_MONEY_NS022a = [
    { id: 'R0', name: 'R0 - ส่งเงินเบิกเกินTKK' },
    { id: 'R8', name: 'R8 - นำส่งเงินทดลองราชการ' },
  ];
  public LIST_TYPE_SEARCH_DEPOSIT_MONEY_NS022a = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'R0', name: 'R0 - ส่งเงินเบิกเกินTKK' },
    { id: 'R8', name: 'R8 - นำส่งเงินทดลองราชการ' },
  ];
  // ประเภทการรับเงิน นส03
  public RECEIVING_TYPE_FUND_NS03 = [
    { id: 'RC', name: 'RC - รายได้แผ่นดินแทนกัน' },
    { id: 'RD', name: 'RD - เงินฝากคลังแทนกัน' },
  ];
  public LIST_TYPE_RECEIVE_MONEY_NS03 = [
    { id: 'RC', name: 'RC - รายได้แผ่นดินแทนกัน' },
    { id: 'RD', name: 'RD - เงินฝากคลังแทนกัน' },
  ];
  public LIST_TYPE_SEARCH_RECEIVE_MONEY_NS03 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'RC', name: 'RC - รายได้แผ่นดินแทนกัน' },
    { id: 'RD', name: 'RD - เงินฝากคลังแทนกัน' },
  ];
  public LIST_TYPE_MONEY_NS03 = [
    { id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' },
    { id: '1101020601', name: 'กรณีเงินฝากธนาคารเพื่อนำส่งคลัง' },
    { id: '1101020606', name: 'กรณีเงินฝากธนาคารรายบัญชีเพื่อนำส่งคลัง' },
  ];
  public LIST_TYPE_MONEY_NS051_O1 = [
    { id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' },
    { id: '1101020601', name: 'กรณีเงินฝากธนาคารเพื่อนำฝากคลัง' },
    { id: '1101020801', name: 'กรณีเงินฝาก ธปท.เงินกู้เพื่อช่วยกองทุนฟื้นฟูการเงิน FIDF3' },
    { id: '1101020802', name: 'กรณีเงินฝาก ธปท.จากเงินกู้เพื่อปรับโครงสร้างหนี้ FIDF3' },
    { id: '1101020809', name: 'กรณีเงินฝาก ธปท.เพื่อการบริหารหนี้' },
  ];
  public LIST_TYPE_MONEY_NS051_O2 = [
    { id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' },
    { id: '1101020601', name: 'กรณีเงินฝากธนาคารเพื่อนำฝากคลัง' },
  ];
  public LIST_TYPE_DEPOSIT_MONEY_NS051 = [
    { id: 'O1', name: 'O1 - นำส่งเงินในของตน' },
    { id: 'O2', name: 'O2 - นำส่งเงินนอกงบของตน' },
  ];
  public LIST_TYPE_SEARCH_DEPOSIT_MONEY_NS051 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'O1', name: 'O1 - นำส่งเงินในของตน' },
    { id: 'O2', name: 'O2 - นำส่งเงินนอกงบของตน' },
  ];
  public LIST_TYPE_MONEY_NS052 = [
    { id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' },
    { id: '1101020601', name: 'กรณีเงินฝากธนาคารเพื่อนำฝากคลัง' },
    { id: '1101020606', name: 'กรณีเงินฝากธนาคารรายบัญชีเพื่อนำฝากคลัง' },
  ];
  public LIST_TYPE_DEPOSIT_MONEY_NS052 = [{ id: 'O9', name: 'O9 - นำส่งนอกงบจากปีเก่า' }];
  public LIST_TYPE_SEARCH_DEPOSIT_MONEY_NS052 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'O9', name: 'O9 - นำส่งนอกงบจากปีเก่า' },
  ];
  // KB
  public FORM_ID_KB = {
    kb01: 'E01',
    kb02: 'E02',
    kb03: 'E03',
    kb04: '',
    kb05: 'E06',
    kb06: 'E07',
    kb07: '',
    kb08: 'E15',
    kb09: 'E16',
    kb10: 'E17',
    kb11: 'E08',
    kb011: 'E21',
    kb012: 'E22',
    kb021: 'E23',
    kb24: 'E24',
    kb25: 'E25',
    kb26: 'E26',
    kb27: 'E27',
  };
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB02 = [
    { id: '1', name: 'เพื่อจ่ายผู้ขาย/คู่สัญญา' },
    { id: '2', name: 'เพื่อชดใช้ใบสำคัญ' },
    { id: '3', name: 'เพื่อจ่ายเงินเดือนและเงินอื่นที่จ่ายสิ้นเดือน' },
    { id: '4', name: 'เพื่อจ่ายให้ยืม' },
    { id: '5', name: 'รายการขอเบิกเงินอุดหนุน' },
  ];
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB023 = [{ id: '1', name: 'เพื่อจ่ายผู้ขาย/คู่สัญญา' }];
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB03 = [
    { id: '1', name: 'เพื่อจ่ายผู้ขาย/คู่สัญญา' },
    { id: '2', name: 'เพื่อชดใช้ใบสำคัญ' },
    { id: '3', name: 'เพื่อจ่ายเงินเดือนและเงินอื่นที่จ่ายสิ้นเดือน' },
    { id: '4', name: 'เพื่อจ่ายให้ยืม' },
    { id: '5', name: 'รายการขอเบิกวงเงินทดรองราชการ' },
  ];
  public LIST_TYPE_SEARCH_DOCTYPE_KB = new Map([
    ['K0',  'K0 - เงินจ่ายสิ้นเดือน'],
    ['K1',  'K1 - ลูกหนี้เงินยืม'],
    ['K8',  'K8 - เงินอุดหนุน'],
    ['KC',  'KC - ขอเบิก(1.ข)'],
    ['KD',  'KD - ขอเบิก(1.ข) กันเงิน'],
    ['KE',  'KE - ขอเบิก(2.ข)'],
    ['KF',  'KF - ขอเบิก(2.ข) กันเงิน'],
    ['KL',  'KL - ใบสำคัญงปม(2)'],
    ['KM',  'KM - ใบสำคัญงปม(2) กันเงิน'],
    ['KH',  'KH - ขอเบิก(3.ข)'],
    ['KA',  'KA - ขอเบิก(1.ก)'],
    ['K6',  'K6'],
    ['KI',  'KI - ขอเบิก(4.ข)'],
    ['KQ',  'KQ'],
    ['KS',  'KS'],
    ['KB',  'KB - ขอเบิก(1.ก) กันเงิน'],
    ['KG',  'KG - ขอเบิก(3.ก)'],
    ['KN',  'KN - ใบสำคัญนอกงปม.(4)'],
    ['K5',  'K5 - เงินดาวน์'],
    ['KX',  'KX'],
    ['KY',  'KY - ค้างรับ/ค้างจ่าย'],
    ['JV',  'JV - บันทึกรายการบัญชีทั่วไปไม่เกี่ยวกับเงินสดและเทียบเท่าเงินสด'],
    ['J0',  'J0 - ปรับเงินฝากคลัง-Auto'],
  ]);
  public LIST_TYPE_SEARCH_DOCTYPE_KBALL = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'K0', name: 'K0 - เงินจ่ายสิ้นเดือน' },
    { id: 'K1', name: 'K1 - ลูกหนี้เงินยืม' },
    { id: 'K8', name: 'K8 - เงินอุดหนุน' },
    { id: 'KC', name: 'KC - ขอเบิก(1.ข)' },
    { id: 'KD', name: 'KD - ขอเบิก(1.ข) กันเงิน' },
    { id: 'KE', name: 'KE - ขอเบิก(2.ข)' },
    { id: 'KF', name: 'KF - ขอเบิก(2.ข) กันเงิน' },
    { id: 'KL', name: 'KL - ใบสำคัญงปม(2)' },
    { id: 'KM', name: 'KM - ใบสำคัญงปม(2) กันเงิน' },
    { id: 'KH', name: 'KH - ขอเบิก(3.ข)' },
    { id: 'KA', name: 'KA - ขอเบิก(1.ก)' },
    { id: 'K6', name: 'K6' },
    { id: 'KI', name: 'KI - ขอเบิก(4.ข)' },
    { id: 'KQ', name: 'KQ' },
    { id: 'KS', name: 'KS' },
    { id: 'KB', name: 'KB - ขอเบิก(1.ก) กันเงิน' },
    { id: 'KG', name: 'KG - ขอเบิก(3.ก)' },
    { id: 'KN', name: 'KN - ใบสำคัญนอกงปม.(4)' },
    { id: 'K5', name: 'K5 - เงินดาวน์' },
    { id: 'KX', name: 'KX' },
  ];
  public LIST_TYPE_SEARCH_DOCTYPE_KB01 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'K5', name: 'K5 - เงินดาวน์' },
    { id: 'KA', name: 'KA - ขอเบิก(1.ก)' },
    { id: 'KB', name: 'KB - ขอเบิก(1.ก) กันเงิน' },
    { id: 'KG', name: 'KG - ขอเบิก(3.ก)' },
  ];
  public LIST_TYPE_SEARCH_DOCTYPE_KB02 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'K0', name: 'K0 - เงินจ่ายสิ้นเดือน' },
    { id: 'K1', name: 'K1 - ลูกหนี้เงินยืม' },
    { id: 'K8', name: 'K8 - เงินอุดหนุน' },
    { id: 'KC', name: 'KC - ขอเบิก(1.ข)' },
    { id: 'KD', name: 'KD - ขอเบิก(1.ข) กันเงิน' },
    { id: 'KE', name: 'KE - ขอเบิก(2.ข)' },
    { id: 'KF', name: 'KF - ขอเบิก(2.ข) กันเงิน' },
    { id: 'KL', name: 'KL - ใบสำคัญงปม(2)' },
    { id: 'KM', name: 'KM - ใบสำคัญงปม(2) กันเงิน' },
  ];
  public LIST_TYPE_SEARCH_DOCTYPE_KB021 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'KH', name: 'KH - ขอเบิก(3.ข)' },
    { id: 'KS', name: 'KS - ขอเบิกเงินกู้นอกงบ3ข' },
    { id: 'KC', name: 'KC - ขอเบิก(1.ข)' },
    { id: 'KD', name: 'KD - ขอเบิก(1.ข) กันเงิน' },
  ];
  public LIST_TYPE_SEARCH_DOCTYPE_KB11 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'K5', name: 'K5 - เงินดาวน์' },
    { id: 'KA', name: 'KA - ขอเบิก(1.ก)' },
    { id: 'KB', name: 'KB - ขอเบิก(1.ก) กันเงิน' },
    { id: 'KG', name: 'KG - ขอเบิก(3.ก)' },
  ];
  public LIST_TYPE_SEARCH_DOCTYPE_KB03 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'K0', name: 'K0 - เงินจ่ายสิ้นเดือน' },
    { id: 'K1', name: 'K1 - ลูกหนี้เงินยืม' },
    { id: 'K2', name: 'K2 - เงินทดรอง' },
    { id: 'KH', name: 'KH - ขอเบิก(3.ข)' },
    { id: 'KI', name: 'KI - ขอเบิก(4.ข)' },
    { id: 'KN', name: 'KN - ใบสำคัญนอกงปม.(4)' },
  ];
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB05 = [{ id: '1', name: 'รายการขอถอนคืนรายได้แผ่นดิน' }];
  public LIST_PAYMENT_KB05 = [{ id: '2', name: 'จ่ายผ่านบัญชีเงินฝากธนาคารของหน่วยงาน' }];
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB06 = [{ id: '1', name: 'รายการขอถอนคืนรายได้เงินนอกงบประมาณ' }];
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB08 = [{ id: '1', name: 'รายการขอถอนคืนรายได้เงินนอกงบประมาณ' }];
  public LIST_PAYMENT_KB08 = [{ id: '1', name: 'จ่ายตรงเข้าบัญชีเงินฝากธนาคารของผู้ขาย/คู่สัญญา' }];
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB09 = [{ id: '1', name: 'รายการถอนคืนรายได้แผ่นดินผ่านระบบ BAHTNET' }];
  public LIST_PAYMENT_KB09 = [{ id: '1', name: 'จ่ายตรงผู้ขายที่เป็นสรก.ในงบ' }];
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB10 = [{ id: '1', name: 'รายการถอนเงินจัดสรรให้ อปท. ผ่านระบบ BAHTNET' }];
  public LIST_PAYMENT_KB10 = [{ id: '1', name: 'จ่ายตรงผู้ขายที่เป็นสรก. นอกงบ' }];
  public LIST_PAYMENT_KB02 = [
    { id: '1', name: 'จ่ายตรงเข้าบัญชีเงินฝากธนาคารของผู้ขาย/คู่สัญญา' },
    { id: '2', name: 'จ่ายผ่านบัญชีเงินฝากธนาคารของหน่วยงาน' },
  ];
  public LIST_PAYMENT_KB023 = [
    { id: '1', name: 'จ่ายตรงผู้ขายที่เป็นส่วนราชการ นอกงบ' },
    { id: '2', name: 'จ่ายตรงผู้ขายที่เป็นส่วนราชการ ในงบ' },
  ];
  // PK
  public FORM_ID_PK = {
    pk01: 'V01',
  };
  public LIST_TYPE_GROUP_SELLER_PK = [
    { id: '', name: '------ เลือกประเภทกลุ่มผู้ขาย ------' },
    { id: '1000', name: '1000 - ผู้ขายทั่วไป(นิติบุคคล-บริษัท)' },
    { id: '2000', name: '2000 - กลุ่มผุ้ขายทั่วไป(บุคคลธรรมดา)' },
    { id: '6000', name: '6000 - กลุ่มเจ้าหนี้ต่างประเทศ' },
  ];
  public LIST_TYPE_SEARCH_GROUP_SELLER_PK = [
    { id: '', name: '------ เลือกประเภทกลุ่มผู้ขาย ------' },
    { id: '1000', name: '1000 - ผู้ขายทั่วไป(นิติบุคคล-บริษัท)' },
    { id: '2000', name: '2000 - กลุ่มผุ้ขายทั่วไป(บุคคลธรรมดา)' },
    { id: '3000', name: '3000 - กลุ่มเจ้าหนี้การค้าส่วนราชการ' },
    { id: '6000', name: '6000 - กลุ่มเจ้าหนี้ต่างประเทศ' },
  ];
  // pk approveStatus
  public STATUS_APPROVE = {
    0: 'Wait for approve',
    1: 'Approved',
  };
  // BS
  public FORM_ID_BS = {
    bs01: 'P01',
    bs01a: '',
    bs01s: '',
    bs02: '',
    bs03: '',
    bs04: 'P04',
    bs05: '',
    bs06: 'P05',
  };
  public LIST_TYPE_SEARCH_CONDITION_BS = [
    { id: '1', name: 'วันที่บันทึกรายการ' },
    { id: '2', name: 'วันที่ใบสั่งซื้อ/สัญญา' },
  ];
  // BR
  public FORM_ID_BR = {
    br01: 'G01',
    br02: 'G02',
    br04: 'S11',
  };
  public LIST_TYPE_SEARCH_CONDITION_BR01 = [
    { id: 'ED', name: 'วันที่บันทึกรายการ' },
    { id: 'PD', name: 'วันที่ผ่านรายการ' },
    { id: 'DD', name: 'วันที่เอกสาร' },
  ];
  // TK
  public FORM_ID_TK = {
    tk01: 'E13',
    tk02: 'E14',
    tk11: 'E11',
    tk24: 'E28',
  };
  public LIST_TYPE_REQUEST_WITHDRAWAL_TK02 = [
    { id: '1', name: 'เพื่อใช้แหล่งเงินกู้' },
    { id: '2', name: 'เพื่อชดใช้ใบสำคัญ' },
    { id: '3', name: 'เพื่อจ่ายให้ยืม' },
  ];
  public LIST_PAYMENT_TK02 = [
    { id: '1', name: 'จ่ายตรงเข้าบัญชีเงินฝากธนาคารของผู้ขาย/คู่สัญญา  ' },
    { id: '2', name: 'จ่ายผ่านบัญชีเงินฝากธนาคารของหน่วยงาน' },
  ];
  public LIST_TYPE_DOCUMENT_SEARCH_TK02 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'KQ', name: 'KQ - ขอเบิกเงินกู้นอกงบ(4)' },
    { id: 'KS', name: 'KS - ขอเบิกเงินกู้นอกงบ3ข' },
  ];
  public LIST_TYPE_REQUEST_WITHDRAWAL_TK24 = [{ id: '1', name: 'เพื่อใช้แหล่งเงินกู้' }];
  public LIST_PAYMENT_TK24 = [{ id: '1', name: 'จ่ายตรงเข้าบัญชีเงินฝากธนาคารของผู้ขาย/คู่สัญญา  ' }];
  public LIST_TYPE_SEARCH_DOCTYPE_TK24 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'KS', name: 'KS - ขอเบิกเงินกู้นอกงบ3ข' },
  ];
  // KJ
  public FORM_ID_KJ = {
    kj05: 'E09',
  };
  public LIST_ACCOUNT_KJ = [
    {
      id: '1101020603',
      name: 'จ่ายจากบัญชีเงินฝากธนาคารในงบประมาณ',
    },
    {
      id: '1101020604',
      name: 'จ่ายจากบัญชีเงินฝากธนาคารนอกงบประมาณที่ฝากคลัง',
    },
    {
      id: '1101020605',
      name: 'จ่ายจากบัญชีเงินฝากธนาคาร (ไทยเข็มแข็ง)',
    },
  ];
  public LIST_TYPE_DOCUMENT_KJ = [{ id: 'PM', name: 'PM - จ่ายเงิน Manual' }];
  // SNG
  public FORM_ID_SNG = {
    sng01: 'F01',
    sng02: 'F08',
    sng03: 'F05',
    sng05: 'F09',
  };
  public LIST_TYPE_SEARCH_CONDITION_SNG = [
    { id: 'ED', name: 'วันที่บันทึกรายการ' },
    { id: 'PD', name: 'วันที่ผ่านรายการ' },
    { id: 'DD', name: 'วันที่เอกสาร' },
  ];
  public LIST_OF_TYPE_DOCUMENT_SNG = [
    // { id: 'AV', name: 'สำรองเงินทุน ลูกหนี้เงินยืม' },
    // { id: 'CB', name: 'กรณีค้างเบิกข้ามปี' },
    // { id: 'CC', name: 'โอนงบกลางเหลื่อมปี' },
    { id: 'CF', name: 'CF - กันเงินเหลื่อมปี-ไม่มีหนี้ผูกพัน' },
    // { id: 'CG', name: 'กรณีย้ายหน่วยเบิกจ่าย' },
    { id: 'CK', name: 'CK - กันเงินเหลื่อมปี-เสมือนมีหนี้ผูกพัน' },
    // { id: 'CM', name: 'กันเงิน-เงินลอย มีค.' },
    // { id: 'CO', name: 'กันเงินเหลื่มปี CONVERSION' },
    // { id: 'CP', name: 'สำหรับอ้างสร้าง PO ใหม่' },
    // { id: 'CS', name: 'กันเงิน-เงินลอย กย.' },
    { id: 'CX', name: 'CX - กันเงินเหลื่อมปี-มีหนี้ผูกพัน' },
    { id: 'CZ', name: 'CZ - กันเงิน-เงินเหลือจ่าย' },
    // { id: 'PF', name: 'งบประมาณที่ผูกพันแล้ว' },
    // { id: 'SA', name: 'การเบิกแทนกัน' },
    // { id: 'SB', name: 'การเบิกแทนกันเหลื่อมปี' },
    { id: 'SC', name: 'SC - กันเงินเหลื่มปีไม่มีหนี้' },
  ];

  
  public LIST_OF_STATUS_DOCUMENT_SNG_SEARCH =[
    { id: '', name: '' },
    { id: 'C', name: 'ยกเลิก' },
    { id: 'E', name: 'หมดอายุ' },
    { id: 'B', name: 'BLOCK' },
    { id: 'N', name: 'ยังไม่ยกเลิก' },
    

  ]
  public LIST_OF_TYPE_DOCUMENT_SNG_SEARCH = [
    { id: '', name: '---- ไม่กำหนด ----' },
    // { id: 'AV', name: 'AV - สำรองเงินทุน ลูกหนี้เงินยืม' },
    // { id: 'CB', name: 'CB - กรณีค้างเบิกข้ามปี' },
    { id: 'CC', name: 'CC - โอนงบกลางเหลื่อมปี' },
    { id: 'CF', name: 'CF - กันเงินเหลื่อมปี-ไม่มีหนี้ผูกพัน' },
    { id: 'CG', name: 'CG - กรณีย้ายหน่วยเบิกจ่าย' },
    { id: 'CK', name: 'CK - กันเงินเหลื่อมปี-เสมือนมีหนี้ผูกพัน' },
    // { id: 'CM', name: 'CM - กันเงิน-เงินลอย มีค.' },
    // { id: 'CO', name: 'CO - กันเงินเหลื่มปี CONVERSION' },
    // { id: 'CP', name: 'CP - สำหรับอ้างสร้าง PO ใหม่' },
    // { id: 'CS', name: 'CS - กันเงิน-เงินลอย กย.' },
    { id: 'CX', name: 'CX - กันเงินเหลื่อมปี-มีหนี้ผูกพัน' },
    { id: 'CZ', name: 'CZ - กันเงิน-เงินเหลือจ่าย' },
    // { id: 'PF', name: 'PF - งบประมาณที่ผูกพันแล้ว' },
    // { id: 'SA', name: 'SA - การเบิกแทนกัน' },
    // { id: 'SB', name: 'SB - การเบิกแทนกันเหลื่อมปี' },
    // { id: 'SC', name: 'SC - กันเงินเหลื่มปีไม่มีหนี้' },
  ];
  // public LIST_REASON_SNG = [
  //   { id: '', name: '------ ไม่กำหนด ------' },
  //   {
  //     id: '2001',
  //     name: '2001 - การจัดสรรงปม./พรก.เงินกู้ ของส่วนราชการไปยังส่วนราชการระดับหน่วยเบิกจ่าย',
  //   },
  //   { id: '2002', name: '2002 - การโอนเงินเหลือจ่าย TKK 2555' },
  //   { id: '2003', name: '2003 - การโอนเงินเหลือจ่าย/พรก.เงินกู้' },
  //   {
  //     id: '2101',
  //     name: '2101 - การจัดสรรหรือการโอนงปม./พรก.เงินกู้ ของส่วนราชการไปยังระดับกอง',
  //   },
  //   { id: '2102', name: '2102 - การโอนเงินเหลือจ่าย/พรก.เงินกู้ ระดับกอง' },
  //   { id: '2103', name: '2103 - การโอนเงินเหลือจ่าย/พรก.เงินกู้ ระดับกอง' },
  //   {
  //     id: '3001',
  //     name: '3001 - การปรับเปลี่ยนงปม.ที่เป็นไปตามระเบียบว่าด้วยการบริหารงปม. พ.ศ. 2548',
  //   },
  //   {
  //     id: '3002',
  //     name: '3002 - การปรับเปลี่การโอน/เปลี่ยนแปลงงบประมาณเหลือจ่ายที่ได้ดำเนินงานบรรลุวัตถุประสงค์แล้ว (ชำระค่าสาธารณูปโภคแล้ว)',
  //   },
  //   {
  //     id: '3003',
  //     name: '3003 - การปรับเปลี่ยนงปม.ภายใต้แผนงานเดียวกัน ไปเพิ่มในงบบุคลากร ไม่เป็นการกำหนดอัตราตั้งใหม่',
  //   },
  //   {
  //     id: '3004',
  //     name:
  //       '3004 - การปรับเปลี่ยนงปม.ภายใต้แผนงานเดียวกัน โดยงปม.ที่ได้รับจัดสรรไม่สามารถจัดหาได้ โดยเพิ่มวงเงินรายการครุภัณฑ์สิ่งก่อสร้างไม่เกินร้อยละสิบของวงเงินที่ได้รับจัดสรร',
  //   },
  //   {
  //     id: '3101',
  //     name: '3101 - การจัดสรรหรือการโอนงปม. ของส่วนราชการไปยังระดับกอง (จากการโอน  3000)',
  //   },
  //   {
  //     id: '6001',
  //     name: '6001 - การปรับเปลี่ยนงปม.งบกลางของส่วนราชการ ที่นำความตามระเบียบว่าด้วยกาบริหารงบประมาณ พศ.2546 มาบังคับใช้โดยอนุโลม',
  //   },
  //   {
  //     id: '6002',
  //     name: '6002 - การปรับเปลี่ยนงปม.งบกลางของส่วนราชการ ที่นำความตามระเบียบว่าด้วยกาบริหารงบประมาณ พศ.2546 มาบังคับใช้โดยอนุโลม',
  //   },
  //   {
  //     id: '6101',
  //     name: '6101 - การปรับเปลี่ยนงปม.งบกลางของส่วนราชการ ที่นำความตามระเบียบว่าด้วยกาบริหารงบประมาณ พศ.2546 มาบังคับใช้โดยอนุโลม',
  //   },
  //   {
  //     id: '6102',
  //     name: '6102 - การปรับเปลี่ยนงปม.งบกลางของส่วนราชการ ที่นำความตามระเบียบว่าด้วยกาบริหารงบประมาณ พศ.2546 มาบังคับใช้โดยอนุโลม',
  //   },
  // ];
  // ST
  public FORM_ID_ST = {
    st01: 'S01',
    st11: 'S11',
    st19: 'P01',
    st20: 'P01',
    st21: 'P01',
  };
  public LIST_TYPE_DOCUMENT_ST = [{ id: 'AA', name: 'AA - ผ่านรายการสินทรัพย์' }];

  public LIST_TYPE_DOCUMENT_ST131 = [
    { id: 'AA', name: 'AA - ผ่านรายการสินทรัพย์' },
    {
      id: 'JV',
      name: 'JV - บันทึกรายการบัญชีทั่วไปไม่เกี่ยวกับเงินสดและเทียบเท่าเงินสด',
    },
    { id: 'JJ', name: 'JJ - การผ่านรายการหักล้าง' },
  ];
  public LIST_PK_ST131 = [
    { id: '70', name: '70 - เดบิตสินทรัพย์' },
    { id: '40', name: '40 - รายการเดบิต' },
  ];
  // OM
  public FORM_ID_OM = {
    om01: 'Z01',
    om02: 'Z02',
    om03: 'Z03',
  };
  public LIST_TYPE_DOCUMENT_SEARCH_OM03 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'R3', name: 'R3 - รายได้แผ่นดินแทนกัน' },
    { id: 'R4', name: 'R4 - เงินฝากคลังแทนกัน' },
  ];
  // mock doctype wait for service
  public LIST_DOC_TYPE_OM = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'AA', name: 'AA - ผ่านรายการสินทรัพย์' },
    { id: 'AF', name: 'AF - ผ่านรายการค่าเสื่อมฯ' },
    { id: 'AI', name: 'AI - สินทรัพย์ Interfaced' },
    { id: 'AN', name: 'AN - ผ่านสินทรัพย์สุทธิ' },
    { id: 'AO', name: 'AO - สินทรัพย์เก่า' },
    { id: 'AT', name: 'AT - ผ่านรายการสินทรัพย์' },
    { id: 'AZ', name: 'AZ - กลับรายการสินทรัพย์' },
    { id: 'B7', name: 'B7 - ปรับปรุงงบพลาง49to50' },
  ];

  public LIST_DOC_TYPE_SEARCH_OM = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'AA', name: 'AA - ผ่านรายการสินทรัพย์' },
    { id: 'AF', name: 'AF - ผ่านรายการค่าเสื่อมฯ' },
    { id: 'AI', name: 'AI - สินทรัพย์ Interfaced' },
    { id: 'AN', name: 'AN - ผ่านสินทรัพย์สุทธิ' },
    { id: 'AO', name: 'AO - สินทรัพย์เก่า' },
    { id: 'AT', name: 'AT - ผ่านรายการสินทรัพย์' },
    { id: 'AZ', name: 'AZ - กลับรายการสินทรัพย์' },
    { id: 'B7', name: 'B7 - ปรับปรุงงบพลาง49to50' },
    { id: 'BA', name: 'BA - ปรับยอด Inter BA' },
    { id: 'BD', name: 'BD - เบิกเกินส่งคืน' },
    { id: 'BE', name: 'BE - BE คืนงบ ในปี' },
    { id: 'BF', name: 'BF - BF คืนงบ ข้ามปี' },
    { id: 'BG', name: 'BG - พัก-ระบบงบประมาณ' },
    { id: 'BT', name: 'BT - เบิกเกินส่งคืน TKK' },
    { id: 'CA', name: 'CA - รับเข้าบ/ชส่วนราชการ' },
    { id: 'CB', name: 'CB - โอนออกบ/ชส่วนราชการ' },
    { id: 'CC', name: 'CC - โอนเข้าบ/ชKTB-CC' },
    { id: 'CD', name: 'CD - โอนเข้าบ/ชBOT-TR1' },
    { id: 'CE', name: 'CE - โอนออกจาก BOT-TR1' },
    { id: 'CF', name: 'CF - กันเงินเหลื่อมปี - ไม่มีหนี้ผูกพัน' },
    { id: 'CG', name: 'CG - กรณีย้ายหน่วยเบิกจ่าย' },
    { id: 'CH', name: 'CH - โอนออกจากบ/ช KTB-CC' },
    { id: 'CI', name: 'CI - รับ/บันทึกเช็คขัดข้อง' },
    { id: 'CJ', name: 'CJ - บเข้าบ/ช statement' },
    { id: 'CK', name: 'CK - กันเงินเหลื่อมปี - เสมือนมีหนี้ผูกพัน' },
    { id: 'CL', name: 'CL - หักล้างบัญชีอัตโนมัต' },
    { id: 'CN', name: 'CN - แก้ไข บ/ช statement' },
    { id: 'CO', name: 'CO - กลับ บ/ช statement' },
    { id: 'CX', name: 'CX - กันเงินเหลื่อมปี - มีหนี้ผูกพัน' },
  ];
  public LIST_PAYMENT_OM = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: '0', name: '0 - จ่ายตรงจากแหล่งเงินกู้ นอก TR1' },
    { id: '1', name: '1 - จ่ายตรงผู้ขาย เงินงบประมาณ' },
    { id: '2', name: '2 - จ่ายเงินในงบให้Agency-Indirect' },
    { id: '3', name: '3 - จ่ายตรงผู้ขายเงินนอกงบประมาณ' },
    { id: '4', name: '4 - จ่ายเงินนอกงบให้Agency-Indirec' },
    { id: '5', name: '5 - จ่ายเงินนอกงปม. นอก TR1' },
    { id: '6', name: '6 - จ่ายสำรองค.กเงินกู้ตปท.-Direct' },
    { id: '7', name: '7 - จ่ายสำรองค.ก.เงินกู้ตปท.-Indir' },
    { id: '8', name: '8 - จ่ายชำระเงินกู้ ในงบ Direct' },
    { id: '9', name: '9 - จ่ายชำระเงินกู้ ในงบ InDirect' },
  ];
  // OS
  public FORM_ID_OS = {
    os01: 'P07',
    os02: 'P08',
    os03: 'P09',
    os04: 'P10',
    os05: 'P13',
  };
  // SL
  public FORM_ID_SL = {
    sl01: 'YY',
  };
  // OP
  public FORM_ID_OP = {
    op01: 'F06',
  };
  // All
  public LIST_TYPE_GENERAL_TEXT = [
    { id: 'F01', name: 'F01 - GP - วันที่ใบสั่งซื้อ' },
    { id: 'F02', name: 'F02 - GP - ใบเสนอราคาเลขที่' },
  ];
  public LIST_TYPE_ITEM_TEXT = [
    { id: 'F01', name: 'F01 - ข้อความในรายการ' },
    { id: 'F02', name: 'F02 - ข้อความ PO เรคคอร์ดข้อมูบ' },
  ];

  public LIST_TYPE_TAX = [
    { id: 'ZVAT', name: 'ภาษีจากการจัดซื้อ(บาท)' },
    { id: 'ZVA2', name: 'ภาษีจากการจัดซื้อ(%)' },
  ];
  public LIST_TYPE_PROCUREMENT = [
    { id: 'I', name: 'I - วัสดุคงคลัง - มูลค่า' },
    { id: 'K', name: 'K - ค่าใช้จ่าย' },
    { id: 'S', name: 'S - สินทรัพย์ - บัญชีพัก' },
  ];
  public LIST_TYPE_REQUEST_WITHDRAWAL = [
    { id: '1', name: 'ขอเบิกเงินในงบประมาณ' },
    { id: '2', name: 'ขอเบิกเงินนอกงบประมาณที่ฝากคลัง' },
  ];
  public LIST_PROCUREMENT = [
    { id: '01', name: '01 - วิธีตกลงราคา' },
    { id: '02', name: '02 - วิธีสอบราคา' },
    { id: '03', name: '03 - วิธีประกวดราคา' },
    { id: '04', name: '04 - วิธีพิเศษ' },
    { id: '05', name: '05 - วิธีกรณีพิเศษ' },
    { id: '06', name: '06 - e-AUCTION' },
    { id: '07', name: '07 - วิธีตกลง' },
    { id: '08', name: '08 - วิธีคัดเลือก' },
    { id: '09', name: '09 - วิธีคัดเลือกแบบจำกัดข้อกำหนด' },
    { id: '13', name: '13 - วิธีพิเศษเลือกจ้าง' },
    { id: '14', name: '14 - วิธีพิเศษประกวดแบบ' },
    { id: '15', name: '15 - e-market' },
    { id: '16', name: '16 - e-bidding' },
    { id: '18', name: '18 - คัดเลือก' },
    { id: '19', name: '19 - เฉพาะเจาะจง' },
    { id: '20', name: '20 - จ้างที่ปรึกษาวิธีประกาศเชิญชวน' },
    { id: '21', name: '21 - จ้างที่ปรึกษาวิธีคัดเลือก' },
    { id: '22', name: '22 - จ้างที่ปรึกษาวิธีเฉพาะเจาะจง' },
    { id: '23', name: '23 - จ้างออกแบบฯ วิธีประกาศเชิญชวน' },
    { id: '24', name: '24 - จ้างออกแบบฯ วิธีคัดเลือก' },
    { id: '25', name: '25 - จ้างออกแบบฯ วิธีเฉพาะเจาะจง' },
    { id: '26', name: '26 - จ้างออกแบบฯ วิธีประกวดแบบ' },
    { id: '99', name: '99 - ไม่เข้าข่ายจัดซื้อฯตามระเบียบฯ' },
  ];
  public TYPE_TAX_LIST = [
    { id: '0: 1', name: 'ภาษีจากการจัดซื้อ(บาท)' },
    { id: '1: 2', name: 'ภาษีจากการจัดซื้อ(%)' },
  ];
  public DOCUMENT_TYPE = [
    { id: '0: 1', name: 'CF - กันเงินเหลื่อมปี - ไม่มีหนี้ผูกพัน' },
    { id: '1: 2', name: 'CK - กันเงินเหลื่อมปี - เสมือนมีหนี้ผูกพัน' },
    { id: '2: 3', name: 'CX - กันเงินเหลื่อมปี - มีหนี้ผูกพัน' },
    { id: '3: 4', name: 'CZ - กันเงิน - เงินเหลือจ่าย' },
  ];
  public LIST_UNIT_FOR_ORDER = [
    { id: 'EA', name: 'EA - ชิ้น' },
    { id: 'EB', name: 'EB - อัน' },
  ];
  public LIST_REASON_CANCEL_ORDER = [
    { id: '', name: '---- กรุณาระบุเหตุผลในการยกเลิก ----' },
    { id: '0001', name: '0001 - แก้ไขปริมาณ' },
    { id: '0002', name: '0002 - แก้ไขราคา' },
    { id: '0003', name: '0003 - แก้ไขทั้งปริมาณและราคา' },
    { id: '0004', name: '0004 - แก้ไขกำหนดส่งมอบ' },
    { id: '0005', name: '0005 - ลบรายการเนื่องจากคีย์ข้อมูลผิด' },
    { id: '0006', name: '0006 - ยกเลิกรายการสั่งซื้อบางรายการ' },
    { id: '0007', name: '0007 - ยกเลิกการสั่งซื้อ/จ้างทั้งใบ' },
    { id: '0008', name: '0008 - ยกเลิกสัญญาเพราะผู้ขายทิ้งงาน' },
    { id: '9999', name: '9999 - อื่นๆ' },
  ];
  public LIST_REASON_BACK_LIST = [
    { id: '', name: '---- กรุณาระบุเหตุผลในการกลับรายการ ----' },
    { id: '01', name: '01 - การกลับรายการเนื่องจากรหัสบัญชีผิด' },
    { id: '02', name: '02 - การกลับรายการเนื่องจากจำนวนเงินผิด' },
    { id: '03', name: '03 - การกลับรายการเนื่องจากรหัสอื่นๆผิด' },
    { id: '04', name: '04 - การกลับรายการเนื่องจากผิดจากหลายสาเหตุ' },
    { id: '05', name: '05 - การกลับรายการค้างรับ/ค้างจ่าย' },
    { id: '06', name: '06 - การกลับรายการเมื่อปิดงวด' },
    { id: '07', name: '07 - การกลับรายการขอเบิกที่ไม่ผ่านการอนุมัติ' },
  ];
  public LIST_YEAR = [];
  public LIST_ROUND = [
    { id: '1', name: 'กันยายน' },
    { id: '2', name: 'มีนาคม' },
  ];
  public LIST_TYPE_SEARCH_CONDITION = [
    { id: '1', name: 'วันที่บันทึกรายการ' },
    { id: '2', name: 'วันที่ผ่านรายการ' },
    { id: '3', name: 'วันที่เอกสาร' },
  ];
  public LIST_TYPE_SEARCH_CONDITION_NS = [
    { id: '1', name: 'วันที่บันทึกรายการ' },
    { id: '2', name: 'ประจำวันที่' },
  ];
  public LIST_TYPE_DOCUMENT = [
    { id: 'J4', name: 'J4 - โอนสินทรัพย์ interface ภายในกรม' },
    { id: 'J5', name: 'J5 - โอนสินทรัพย์ interface ข้ามกรม' },
    { id: 'J6', name: 'J6 - โอนวัสดุคงคลังข้ามกรม' },
    {
      id: 'N1',
      name: 'N1 - เบิกหักผลักส่งเงินงบประมาณเป็นเงินฝากคลังของทุนหมุนเวียน',
    },
    { id: 'RI', name: 'RI - โอนขายบิลภายในกรมเดียวกัน (รายได้)' },
    { id: 'RJ', name: 'RJ - โอนขายบิลข้ามกรม (รายได้)' },
    { id: 'RK', name: 'RK - โอนขายบิลภายในกรมเดียวกัน (หนีสิ้น)' },
    { id: 'RL', name: 'RL - โอนขายบิลข้ามกรม (หนีสิ้น)' },
    { id: 'RM', name: 'RM - โอนขายบิลจากทุนหมุนเวียนไปหน่วยงานในส่วนภูมิภาค' },
    {
      id: 'RN',
      name: 'RN - โอนขายบิลจากหน่วยงานในส่วนภูมิภาคให้ทุนหมุนเวียนเป็นเงินฝากกองคลังหน่วยงานภาครัฐ',
    },
    {
      id: 'RO',
      name: 'RO - โอนขายบิลจากหน่วยงานในส่วนภูมิภาคให้ทุนหมุนเวียนเป็นรายได้',
    },
    { id: 'SQ', name: 'SQ - บันทึกปรับปรุงบัญชีรายได้แผ่นดินรอนำส่งคลัง' },
  ];
  public SEARCH_LIST_TYPE_DOCUMENT = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'J4', name: 'J4 - โอนสินทรัพย์ interface ภายในกรม' },
    { id: 'J5', name: 'J5 - โอนสินทรัพย์ interface ข้ามกรม' },
    { id: 'J6', name: 'J6 - โอนวัสดุคงคลังข้ามกรม' },
    {
      id: 'N1',
      name: 'N1 - เบิกหักผลักส่งเงินงบประมาณเป็นเงินฝากคลังของทุนหมุนเวียน',
    },
    { id: 'RI', name: 'RI - โอนขายบิลภายในกรมเดียวกัน (รายได้)' },
    { id: 'RJ', name: 'RJ - โอนขายบิลข้ามกรม (รายได้)' },
    { id: 'RK', name: 'RK - โอนขายบิลภายในกรมเดียวกัน (หนีสิ้น)' },
    { id: 'RL', name: 'RL - โอนขายบิลข้ามกรม (หนีสิ้น)' },
    { id: 'RM', name: 'RM - โอนขายบิลจากทุนหมุนเวียนไปหน่วยงานในส่วนภูมิภาค' },
    {
      id: 'RN',
      name: 'RN - โอนขายบิลจากหน่วยงานในส่วนภูมิภาคให้ทุนหมุนเวียนเป็นเงินฝากกองคลังหน่วยงานภาครัฐ',
    },
    {
      id: 'RO',
      name: 'RO - โอนขายบิลจากหน่วยงานในส่วนภูมิภาคให้ทุนหมุนเวียนเป็นรายได้',
    },
    { id: 'SQ', name: 'SQ - บันทึกปรับปรุงบัญชีรายได้แผ่นดิรอนำส่งคลัง' },
  ];
  public LIST_AREA_CODE = [{ id: 'P1000', name: 'P1000 ส่วนกลาง' }];
  public LIST_TYPE_DOCUMENT_TEST = [{ id: 'JY', name: 'JY - เอกสารนำเข้างบทดลอง' }];
  public LIST_TRANSACTION_TYPE = [
    {
      id: '200',
      name: '200 - การตัดจำหน่าย (บริจาค) สินทรัพย์ที่ได้มาก่อนปีงบประมาณปัจจุบัน',
    },
    {
      id: '201',
      name: '201 - การตัดจำหน่าย (สูญหาย) สินทรัพย์ที่ได้มาก่อนปีงบประมาณปัจจุบัน',
    },
    {
      id: '202',
      name: '202 - การตัดจำหน่าย (รื้อถอน) สินทรัพย์ที่ได้มาก่อนปีงบประมาณปัจจุบัน',
    },
    {
      id: '210',
      name: '210 - การตัดจำหน่าย (ขาย) สินทรัพย์ที่ได้มาก่อนปีงบประมาณปัจจุบัน',
    },
    {
      id: '250',
      name: '250 - การตัดจำหน่าย (บริจาค) สินทรัพย์ที่ได้มาปีงบประมาณปัจจุบัน',
    },
    {
      id: '251',
      name: '251 - การตัดจำหน่าย (สูญหาย) สินทรัพย์ที่ได้มาปีงบประมาณปัจจุบัน',
    },
    {
      id: '252',
      name: '252 - การตัดจำหน่าย (รื้อถอน) สินทรัพย์ที่ได้มาปีงบประมาณปัจจุบัน',
    },
    {
      id: '260',
      name: '260 - การตัดจำหน่าย (ขาย) สินทรัพย์ที่ได้มาปีงบประมาณปัจจุบัน',
    },
  ];
  public LIST_PK = [
    { id: '40', name: 'เดบิต' },
    { id: '50', name: 'เครดิต' },
  ];
  public LIST_REFUTE = [
    {
      id: '2213010101',
      name: '2213010101 - รายได้รอการรับรู้ / รายได้รับล่วงหน้า - ระยะยาว',
    },
  ];
  public SEARCH_DOC_NUMBER = ' ค้นหาตามเลขที่เอกสาร';
  public SEARCH_ETC_CONDITION = ' ค้นหาตามเงื่อนไขอื่น';
  public BUTTON = {
    create: 'สร้าง',
    edit: 'แก้ไข',
    cancel: 'ยกเลิก',
    search: 'ค้นหา',
    begin_search: 'เริ่มค้นหา',
    back_list: 'กลับรายการ',
    tax_input: 'ระบุภาษีมูลค่าเพิ่ม',
    withholdingTax_input: 'ระบุภาษี หัก ณ ที่จ่าย/ค่าปรับ',
    advance_payment: 'ระบุค่าเงินจ่ายล่วงหน้า',
    addition_general_info: 'ระบุข้อความเพิ่มเติมสำหรับข้อมูลทั่วไป',
  };
  public FORM = {
    order_number: 'เลขที่ใบสั่งซื้อ/สัญญา',
    procurement_choice: 'วิธีการจัดซื้อจัดจ้าง',
    tax_id: 'รหัสประจำตัวผู้เสียภาษี',
    bank_number: 'เลขที่บัญชีเงินฝากธนาคาร',
    start_date_order: 'วันที่ใบสั่งซื้อ/สัญญา',
    end_date_order: 'วันที่สิ้นสุดสัญญา',
  };
  // month
  public monthTh = {
    8: 'ก.ย.',
  };
  // header dialog-search
  public HEADER_DIALOG_SEARCH = {
    typeAccountCode: ['เลือก', 'เลขที่บัญชีแยกประเภททั่วไป', 'คำอธิบาย'],
    centerCode: ['เลือก', 'รหัสศูนย์ต้นทุน', 'ชื่อทั่วไป', 'คำอธิบาย', 'รหัสหน่วยงาน', 'รหัสหน่วยเบิกจ่าย', 'รหัสพื้นที่'],
    areaCode: ['เลือก', 'รหัสพื้นที่', 'ชื่อ', 'คำอธิบาย'],
    sourceMoneyCode: ['เลือก', 'รหัสแหล่งของเงิน', 'ชื่อ', 'คำอธิบาย'],
    sourceBudgetCode: ['เลือก', 'รหัสงบประมาณ', 'ชื่อ', 'คำอธิบาย'],
    sourceBudgetCode2: ['เลือก', 'รหัสงบประมาณ', 'คำอธิบาย', 'รหัสแหล่งของเงิน', 'รายการผูกพันงบประมาณ'],
    mainActivityCode: ['เลือก', 'รหัสกิจกรรมหลัก', 'ชื่อของเขตฟังก์ชั่น'],
    subActivityCode: ['เลือก', 'รหัสกิจกรรมย่อย', 'ชื่อทั่วไป', 'ข้อความแบบยาว', 'รหัสหน่วยงาน'],
    subAccountCode: ['เลือก', 'รหัสบัญชีย่อย', 'คำอธิบาย', 'เจ้าของบัญชีย่อย', 'ประเภท/หมวด'],
    packageCode: ['เลือก', 'กลุ่มพัสดุ', 'รายละเอียดกลุ่มพัสดุ'],
    bankBranch: ['เลือก', 'รหัสประเทศของธนาคาร', 'คีย์ธนาคาร', 'ชื่อธนาคาร', 'แผนงบประมาณ', 'ถนน', 'สาขาธนาคาร'],
    depositAccount: ['เลือก', 'รหัสบัญชีเงินฝาก', 'ชื่อบัญชี', 'เจ้าของบัญชีเงินฝาก', 'ประเภท/หมวด'],
    gpscCode: ['เลือก', 'GPSC', 'คำอธิบาย GPSC', 'กลุ่มวัสดุ'],
    vendorTaxId: ['เลือก', 'รหัสประจำตัวผู้เสียภาษี', 'รหัสผู้ขาย', 'ชื่อผู้ขาย'],
    vendorBankAccount: [
      'เลือก',
      'เลขที่บัญชีเงินฝากธนาคาร',
      'Key ธนาคาร',
      'ลำดับที่',
      // 'รหัสผู้ขาย',
      'รหัสประจำตัวผู้เสียภาษี(ผู้ขาย)',
      'ชื่อผู้ขาย',
      'Block',
    ],
    assetCode: ['เลือก', 'หมวดสินทรัพย์', 'ชื่อหมวดสินทรัพย์-ข้อความแบบย่อ', 'การกำหนดบัญชี', 'คำอธิบายของการกำหนดบัญชี'],
    unit: ['เลือก', 'หน่วยนับ', 'ข้อความหน่วยนับ(ไม่เกิน 10 ตัวอักษร)','ข้อความหน่วยนับ(ไม่เกิน 30 ตัวอักษร)'],
    incomeCode: ['เลือก', 'รหัสรายได้', 'ชื่อรายได้', 'ตั้งแต่่รหัสบัญชีแยกประเภท', 'ถึงรหัสบัญชีแยกประเภท'],
    bankBook: ['เลือก', 'รหัสหน่วยงาน', 'BANK BOOK', 'Short Description', 'Long Description'],
    sideList: ['เลือก', 'รหัสข้อมูลหลักด้าน-รายการ', 'ZTXREF1TXT'],
    budgetReserve: ['เลือก', 'รหัสเอกสารสำรองเงินงบประมาณ', 'ส่วนหัวเอกสาร', 'ประเภทเอกสารการบันทึกเอกสารโดยผู้ใช้', 'รหัสหน่วยงาน'],
  };
  public LIST_STATUS = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'Y', name: 'อนุมัติ' },
    { id: 'N', name: 'ไม่อนุมัติ' },
  ];
  public LABEL_CLASS = {
    disable: 'text-black',
    green: 'text-underline-green',
    required: 'text-underline-red',
    blue: 'text-underline-blue',
  };
  public LIST_TYPE_GROUP_SELLER = [
    { id: '', name: '------ เลือกประเภทกลุ่มผู้ขาย ------' },
    { id: '1000', name: '1000 - ผู้ขายทั่วไป(นิติบุคคล-บริษัท)' },
    { id: '2000', name: '2000 - กลุ่มผุ้ขายทั่วไป(บุคคลธรรมดา)' },
    { id: '3000', name: '3000 - กลุ่มเจ้าหนี้การค้าส่วนราชการ' },
    { id: '6000', name: '6000 - กลุ่มเจ้าหนี้ต่างประเทศ' },
  ];
  // ประเภทเงิน
  public FUND_TYPE = [
    { id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' },
    { id: '1101020601', name: 'กรณีเงินฝากธนาคารเพื่อนำส่งคลัง' },
    { id: '1101020606', name: 'กรณีเงินฝากธนาคารรายบัญชีเพื่อนำส่งคลัง' },
  ];
  public STATUS_CONFIRM = {
    0: 'ไม่มี Vendor สำหรับกรมนี้',
    1: '-',
  };
  // report
  public REPORT_TAIL_HEAD = [
    {
      id: 'bc01',
      title: 'บันทึกรายการบัญชีแยกประเภท (บช.01)',
      description: 'ค้นหารายงานเอกสารบันทึกรายการบัญชี',
      formId: 'J00',
    },
    {
      id: 'bc01s',
      title: 'บันทึกรายการบัญชีแยกประเภท (บช.01-2)',
      description: 'ค้นหารายงานเอกสารบันทึกรายการบัญชี',
      formId: '',
    },
    {
      id: 'bc02',
      title: 'บันทึกรายการปรับปรุงบัญชีค้างรับ-ค้างจ่าย (บช. 02)',
      description: 'ค้นหารายงานเอกสารบันทึกรายการบัญชี',
      formId: 'J03',
    },
    {
      id: 'bc04',
      title: 'บันทึกรายการบัญชี สำหรับเอกสารที่พักไว้ (บช. 04)',
      description: 'ค้นหารายงานเอกสารบันทึกรายการบัญชี',
      formId: 'J04',
    },
    {
      id: 'bc05',
      title: 'งบทดลอง - หน่วยงานอิสระและองค์กรมหาชน (บช. 05)',
      description: 'ค้นหารายงานงบทดลอง - หน่วยงานอิสระและองค์กรมหาชน',
      formId: 'J05',
    },
    { id: 'bc07', title: '-', description: 'ค้นหารายงาน', formId: '' },
    {
      id: 'bc08',
      title: 'งบทดลอง - หน่วยงานต่างประเทศ (บช. 08)',
      description: 'ค้นหารายงานงบทดลอง - หน่วยงานต่างประเทศ',
      formId: 'J08',
    },
    {
      id: 'bc10',
      title: 'งบทดลอง - หน่วยงานอิสระและองค์กรมหาชน (บช. 05)',
      description: 'ค้นหารายงานงบทดลอง - หน่วยงานอิสระและองค์กรมหาชน',
      formId: 'J10',
    },
    {
      id: 'bc11',
      title: 'งบทดลอง - เงินนอกงบประมาณของส่วนราชการ (บช. 11)',
      description: 'ค้นหารายงานงบทดลอง - สร้างงบทดลอง - เงินนอกงบประมาณของส่วนราชการ',
      formId: 'J11',
    },
    {
      id: 'bc12',
      title: 'บันทึกรายการจ่ายย้ายเงินคงคลัง (บช. 12)',
      description: 'ค้นหารายงานเอกสารรายการจ่ายย้ายเงินคงคลัง',
      formId: 'J12',
    },
    {
      id: 'bc13',
      title: 'บันทึกรายการจ่ายย้ายเงินคงคลัง (บช. 12)',
      description: 'ค้นหารายงานเอกสารรายการจ่ายย้ายเงินคงคลัง',
      formId: 'J13',
    },
    {
      id: 'bc14',
      title: 'บันทึกรายการการจ่ายแลกเหรียญกษาปณ์เงินคงคลัง (บช. 14)',
      description: 'ค้นหารายงานเอกสารรายการจ่ายแลกเหรียญกษาปณ์เงินคงคลัง',
      formId: 'J14',
    },
    { id: 'bc04', title: '', description: 'ค้นหารายงาน', formId: '' },
    {
      id: 'bc20',
      title: 'บันทึกรายการตั้งลูกหนี้เช็คขัดข้อง (บช. 20)',
      description: 'ค้นหารายงานเอกสารบันทึกรายการบัญชี',
      formId: 'J20',
    },
    {
      id: 'bc21',
      title: 'บันทึกรายการลดลูกหนี้เช็คขัดข้อง (บช. 21)',
      description: 'ค้นหารายงานเอกสารบันทึกรายการบัญชี',
      formId: 'J21',
    },
    {
      id: 'bc22',
      title: 'บันทึกรายการปรับปรุงบัญชีบัตรภาษี (บช. 22)',
      description: 'ค้นหารายงานเอกสารบันทึกรายการปรับปรุงบัญชี',
      formId: 'J22',
    },
    {
      id: 'bc41',
      title: 'บันทึกรายการเปลี่ยนสภาพจากเหรียญกษาปณ์เงินฝากเป็นเงินคงคลัง (บช. 41)',
      description: 'ค้นหาเอกสารบันทึกรายการเปลี่ยนสภาพจากเหรียญกษาปณ์เงินฝากเป็นเงินคงคลัง',
      formId: 'J41',
    },
    {
      id: 'bc42',
      title: 'บันทึกรายการโอนเงินให้ลูกค้ารายใหญ่ (บช. 42)',
      description: 'ค้นหาเอกสารบันทึกรายการโอนเงินให้ลูกค้ารายใหญ่',
      formId: 'J42',
    },
    {
      id: 'ns021a',
      title: 'นำส่งเงินแบบผ่านรายการ (นส. 02-1)',
      description: 'ค้นหารายงานข้อมูลการนำส่งเงินสำหรับเอกสารผ่านรายการ',
      formId: '',
    },
    {
      id: 'ns022a',
      title: 'นำส่งเงินแบบพักรายการ (นส. 02-2)',
      description: 'ค้นหารายงานข้อมูลการนำส่งเงินสำหรับเอกสารพักรายการ',
      formId: '',
    },
    {
      id: 'ns01',
      title: 'การรับเงินของหน่วยงาน (นส. 01)',
      description: 'ค้นหารายงานการรับเงินของหน่วยงาน',
      formId: '',
    },
    {
      id: 'ns03',
      title: 'การรับเงินแทนกัน (นส. 03)',
      description: 'ค้นหารายงานข้อมูลการรับเงินแทนกัน',
      formId: '',
    },
    {
      id: 'ns021',
      title: 'นำส่งเงินแบบผ่านรายการ (นส. 02-1)',
      description: 'ค้นหารายงานข้อมูลการนำส่งเงินสำหรับเอกสารผ่านรายการ',
      formId: '',
    },
    {
      id: 'ns022',
      title: 'นำส่งเงินแบบพักรายการ (นส. 02-2)',
      description: 'ค้นหารายงานข้อมูลการนำส่งเงินสำหรับเอกสารพักรายการ',
      formId: '',
    },
    {
      id: 'kb01',
      title: 'ขอเบิกเงินงบประมาณที่อ้างใบสั่งซื้อฯ (ขบ. 01)',
      description: 'ค้นหารายงานขอเบิกเงินงบประมาณที่อ้างใบสั่งซื้อฯ',
      formId: 'E01',
    },
    {
      id: 'kb02',
      title: 'ขอเบิกเงินงบประมาณที่ไม่อ้างใบสั่งซื้อฯ (ขบ. 02)',
      description: 'ค้นหารายงานขอเบิกเงินงบประมาณที่ไม่อ้างใบสั่งซื้อฯ',
      formId: 'E02',
    },
    {
      id: 'kb03',
      title: 'ขอเบิกเงินนอกงบประมาณที่ไม่อ้างใบสั่งซื้อฯ (ขบ. 03)',
      description: 'ค้นหารายงานขอเบิกเงินนอกงบประมาณที่ไม่อ้างใบสั่งซื้อฯ',
      formId: 'E03',
    },
    {
      id: 'kb05',
      title: 'ขอถอนคืนรายได้แผ่นดิน (ขบ. 05)',
      description: 'ค้นหารายงานขอถอนคืนรายได้แผ่นดิน',
      formId: 'E06',
    },
    {
      id: 'kb06',
      title: 'ขอถอนคืนรายได้เงินนอกงบประมาณ (ขบ. 06)',
      description: 'ค้นหารายงานขอถอนคืนรายได้เงินนอกงบประมาณ',
      formId: 'E07',
    },
    {
      id: 'kb08',
      title: 'ขอเบิกเงินรายได้จัดสรร (ขบ. 08)',
      description: 'ค้นหารายงานขอเบิกเงินรายได้จัดสรร',
      formId: 'E15',
    },
    {
      id: 'kb09',
      title: 'ขอถอนคืนรายได้แผ่นดินผ่านระบบ BAHTNET (ขบ. 09)',
      description: 'ค้นหารายงานขอถอนคืนรายได้แผ่นดินผ่านระบบ BAHTNET',
      formId: 'E16',
    },
    {
      id: 'kb10',
      title: 'ขอถอนเงินจัดสรรให้ อปท. ผ่านระบบ BAHTNET (ขบ. 10)',
      description: 'ค้นหารายงานขอถอนเงินจัดสรรให้ อปท. ผ่านระบบ BAHTNET',
      formId: 'E17',
    },
    {
      id: 'kb11',
      title: 'ขอเบิกเงินงบประมาณที่ต้องอ้างใบสั่งซื้อฯ การส่งมอบไม่แน่นอน (ขบ. 11)',
      description: 'ค้นหารายงานขอเบิกเงินงบประมาณที่ต้องอ้างใบสั่งซื้อฯ การส่งมอบไม่แน่นอน',
      formId: 'E08',
    },
    {
      id: 'pk01',
      title: 'รายงานขอเบิกเงินงบประมาณที่อ้างใบสั่งซื้อฯ (ขบ. 01)',
      description: 'ค้นหารายงานขอเบิกเงินงบประมาณที่อ้างใบสั่งซื้อฯ',
      formId: 'V01',
    },
    {
      id: 'bs01',
      title: 'สั่งซื้อ/จ้าง/เช่า (บส. 01)',
      description: 'ค้นหารายงานสั่งซื้อ/จ้าง/เช่า',
      formId: 'P01',
    },
    {
      id: 'bs04',
      title: 'สั่งซื้อ/จ้าง/เช่า ประเภทการส่งมอบไม่แน่นอน (บส. 04)',
      description: 'ค้นหารายงานสั่งซื้อ/จ้าง/เช่า ประเภทการส่งมอบไม่แน่นอน',
      formId: 'P04',
    },
    {
      id: 'br01',
      title: 'ตรวจรับพัสดุ (บร. 01)',
      description: 'ค้นหารายงานตรวจรับพัสดุ',
      formId: 'G01',
    },
    {
      id: 'tk01',
      title: 'ขอเบิกเงินกู้อ้างอิงใบสั่งซื้อฯ (ทข. 01)',
      description: 'ค้นหารายงานขอเบิกเงินกู้อ้างอิงใบสั่งซื้อฯ',
      formId: 'E13',
    },
    { id: 'tk02', title: '-', description: 'ค้นหารายงาน', formId: 'E14' },
    {
      id: 'tk11',
      title: 'ขอเบิกเงินกู้อ้างอิงใบสั่งซื้อฯ การส่งมอบไม่แน่นอน (ทข. 11)',
      description: 'ค้นหารายงานขอเบิกเงินกู้อ้างอิงใบสั่งซื้อฯ การส่งมอบไม่แน่นอน',
      formId: 'E11',
    },
    { id: 'kj05', title: '-', description: 'ค้นหารายงาน', formId: '' },
  ];
  public REPORT_DOC_TYPE = [
    { id: 'd', name: 'รายวัน' },
    { id: 'w', name: 'รายสัปดาห์' },
    { id: 'm', name: 'รายเดือน' },
  ];
  // mock up
  public LIST_VENDOR_ANOTHER = [
    { id: 'V100000001', name: 'หน่วยงานภายนอก ' },
    { id: 'V100000002', name: 'หน่วยงานภายใน' },
    { id: 'V100000003', name: 'บริษัท' },
    { id: 'V100000004', name: 'การคลัง' },
  ];
  public LIST_TYPE_SPREADSHEET = [
    { id: 'PO', name: 'PO - แบบฟอร์มเกี่ยวกับใบสั่งซื้อ ' },
    { id: 'VD', name: 'VD - แบบฟอร์มเกี่ยวกับการขอสร้างข้อมูลหลักผู้ขาย' },
    { id: 'RP', name: 'RP - แบบฟอร์มเกี่ยวกับการรับแล้วนำส่งรายได้' },
    { id: 'AP', name: 'AP - แบบฟอร์มเกี่ยวกับการเบิกจ่ายเงิน' },
    { id: 'GL', name: 'GL - แบบฟอร์มเกี่ยวกับงบทดลอง' },
  ];
}
